[
  {
    "day": 1,
    "date": "2026-02-21",
    "headlines": [
      {
        "text": "Supreme Court Strikes Down Trump's Tariffs in Historic 6-3 Ruling",
        "real": true,
        "explanation": "This happened on Feb 19, 2026. The Court ruled the president exceeded trade authority.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "NASA Confirms Water Ice Deposits Found in Permanently Shadowed Lunar Craters",
        "real": false,
        "explanation": "Fabricated. While NASA has detected signs of water on the Moon, no such confirmation has been announced."
      },
      {
        "text": "Artemis II Crew Enters Quarantine as NASA Targets March 6 Moon Launch",
        "real": true,
        "explanation": "Real — the four Artemis II astronauts entered pre-flight quarantine in late February 2026.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "EU Parliament Votes to Ban All Facial Recognition in Public Spaces by 2028",
        "real": false,
        "explanation": "Fabricated. While the EU AI Act restricts some biometric surveillance, no outright ban has been voted on."
      },
      {
        "text": "Israel Strikes Kill at Least 10 in Lebanon as Ceasefire Frays",
        "real": true,
        "explanation": "Real — Israeli strikes hit the Bekaa Valley in February 2026 amid ceasefire tensions.",
        "source": "Arlo's Dispatch"
      }
    ]
  },
  {
    "day": 2,
    "date": "2026-02-22",
    "headlines": [
      {
        "text": "Former Prince Andrew Arrested on Suspicion of Misconduct Linked to Epstein",
        "real": true,
        "explanation": "Real — Andrew was arrested in February 2026 in a historic first for the British royal family.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "OpenAI Announces Plans to Open-Source GPT-5 Core Model Weights",
        "real": false,
        "explanation": "Fabricated. OpenAI has not announced open-sourcing any GPT-5 weights."
      },
      {
        "text": "South Korea Sentences Ex-President Yoon to Life in Prison for Insurrection",
        "real": true,
        "explanation": "Real — Yoon Suk-yeol was sentenced to life for his December 2024 martial law declaration.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Amazon Announces Plan to Replace 40% of Warehouse Workers with Robots by 2027",
        "real": false,
        "explanation": "Fabricated. While Amazon uses extensive automation, no such specific announcement was made."
      },
      {
        "text": "Trump Signs New 10% Global Tariff Hours After Supreme Court Strikes Down His Trade Powers",
        "real": true,
        "explanation": "Real — Trump signed a new executive order reimposing tariffs despite the Court ruling.",
        "source": "Arlo's Dispatch"
      }
    ]
  },
  {
    "day": 3,
    "date": "2026-02-23",
    "headlines": [
      {
        "text": "India's Reliance Bets $110 Billion on AI, Signaling a Global Power Shift",
        "real": true,
        "explanation": "Real — Mukesh Ambani's Reliance announced a massive AI infrastructure investment in 2026.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Switzerland Votes to Ban Large Language Models in Government Decision-Making",
        "real": false,
        "explanation": "Fabricated. Switzerland has not held any such referendum or vote."
      },
      {
        "text": "Rev. Jesse Jackson, Towering Civil Rights Leader, Dies at 84",
        "real": true,
        "explanation": "Real — Jackson passed away in February 2026.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "SpaceX Starship Completes First Successful Mars Orbit Insertion Test",
        "real": false,
        "explanation": "Fabricated. Starship has not attempted any Mars missions as of February 2026."
      },
      {
        "text": "Nvidia and Meta Seal Multibillion-Dollar Chip Deal That Reshapes AI Hardware",
        "real": true,
        "explanation": "Real — the deal was announced in February 2026.",
        "source": "Arlo's Dispatch"
      }
    ]
  },
  {
    "day": 4,
    "date": "2026-02-24",
    "headlines": [
      {
        "text": "Iran Warns of 'Decisive Response' as Trump Sets 10-15 Day Deadline for Nuclear Deal",
        "real": true,
        "explanation": "Real — Trump gave Iran an ultimatum during the Geneva negotiations in February 2026.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Google DeepMind Achieves Breakthrough in Room-Temperature Superconductor Prediction",
        "real": false,
        "explanation": "Fabricated. No such breakthrough has been announced by DeepMind."
      },
      {
        "text": "Killing of Far-Right Activist Shakes France as 11 Arrested in Raids",
        "real": true,
        "explanation": "Real — a far-right figure was killed in France in February 2026, triggering mass arrests.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Alysa Liu Wins Olympic Gold, Ending a 24-Year Drought for US Figure Skating",
        "real": true,
        "explanation": "Real — Liu won gold at the 2026 Winter Olympics.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Japan's Central Bank Raises Interest Rates to 3%, Highest Since 1991",
        "real": false,
        "explanation": "Fabricated. While Japan has raised rates recently, not to 3%."
      }
    ]
  },
  {
    "day": 5,
    "date": "2026-02-25",
    "headlines": [
      {
        "text": "CERN Scientists Detect New Particle That Doesn't Fit the Standard Model",
        "real": false,
        "explanation": "Fabricated. No such discovery has been announced by CERN."
      },
      {
        "text": "Hungary and Slovakia Suspend Diesel Shipments to Ukraine in Escalation",
        "real": true,
        "explanation": "Real — both countries suspended fuel deliveries amid EU tensions in February 2026.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Peru's President Ousted in Express Impeachment Over 'Chifa-Gate' Scandal",
        "real": true,
        "explanation": "Real — Peru's president was removed from office in an unusually fast impeachment process.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Apple Cancels Vision Pro 2, Shifts AR Focus to Lightweight Glasses for 2027",
        "real": false,
        "explanation": "Fabricated. Apple has not announced cancellation of Vision Pro 2."
      },
      {
        "text": "Iran Temporarily Closes the Strait of Hormuz in Provocative Military Exercise",
        "real": true,
        "explanation": "Real — Iran briefly closed the strait during military drills amid tensions with the US.",
        "source": "Arlo's Dispatch"
      }
    ]
  },
  {
    "day": 6,
    "date": "2026-02-26",
    "headlines": [
      {
        "text": "Zuckerberg Testifies Under Oath: 'We Care Deeply About Safety'",
        "real": true,
        "explanation": "Real — Zuckerberg testified in a landmark social media addiction trial in February 2026.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "UK Government Proposes Mandatory AI Watermarking for All Online Content by 2027",
        "real": false,
        "explanation": "Fabricated. While AI watermarking is discussed, no such UK legislation has been proposed."
      },
      {
        "text": "Trump's 'Board of Peace' Holds Inaugural Summit as Key Allies Skip",
        "real": true,
        "explanation": "Real — Trump's new diplomatic initiative launched with notable absences.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Shiffrin Claims Slalom Gold as Winter Olympics Deliver Drama in Milan",
        "real": true,
        "explanation": "Real — Mikaela Shiffrin won gold at the 2026 Milan-Cortina Winter Olympics.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "WHO Declares New Mpox Variant a Public Health Emergency After Spread to 30 Countries",
        "real": false,
        "explanation": "Fabricated. No new Mpox emergency declaration has been made in 2026."
      }
    ]
  },
  {
    "day": 7,
    "date": "2026-02-27",
    "headlines": [
      {
        "text": "Ukraine-Russia Geneva Talks End Without Breakthrough as Russia Demands NATO Withdrawal",
        "real": true,
        "explanation": "Real — the Geneva peace talks stalled over Russia's demands in February 2026.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Tesla Recalls 2 Million Vehicles Over Autopilot Software Defect Linked to 47 Crashes",
        "real": false,
        "explanation": "Fabricated. While Tesla has had recalls, this specific one is not real."
      },
      {
        "text": "Tarique Rahman Returns from Exile to Lead Bangladesh After Landslide Victory",
        "real": true,
        "explanation": "Real — Rahman became Bangladesh's new leader after returning from exile in 2026.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Eight Skiers Found Dead in California's Deadliest Avalanche in Decades",
        "real": true,
        "explanation": "Real — a massive avalanche near Lake Tahoe killed eight skiers in February 2026.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Brazil's Supreme Court Orders Nationwide Ban on X After Musk Refuses Data Compliance",
        "real": false,
        "explanation": "Fabricated. While Brazil and X have had disputes, no nationwide ban was ordered in 2026."
      }
    ]
  },
  {
    "day": 8,
    "date": "2026-02-28",
    "headlines": [
      {
        "text": "Trump Orders Pentagon to Release Classified Files on UFOs and Alien Contact",
        "real": true,
        "explanation": "Real — Trump signed an executive order demanding declassification of UAP files.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "China Launches First Crewed Mission to Its New Deep-Sea Station at 4,000 Meters",
        "real": false,
        "explanation": "Fabricated. China has deep-sea ambitions but has not launched a crewed deep-sea station mission."
      },
      {
        "text": "Erdogan Rejects Israel's Recognition of Somaliland, Warns of Regional Fallout",
        "real": true,
        "explanation": "Real — Turkey's president condemned the move as destabilizing the Horn of Africa.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Boeing 737 MAX Cleared to Fly Again After FAA Lifts Global Grounding Order",
        "real": false,
        "explanation": "Fabricated. No new global grounding of the 737 MAX has occurred in 2026."
      },
      {
        "text": "Geneva Day Two: Witkoff Claims 'Meaningful Progress' But the Gaps Remain",
        "real": true,
        "explanation": "Real — US envoy Witkoff reported progress in the Iran nuclear talks in Geneva.",
        "source": "Arlo's Dispatch"
      }
    ]
  },
  {
    "day": 9,
    "date": "2026-03-01",
    "headlines": [
      {
        "text": "US Military 'Ready to Strike Iran as Early as This Weekend,' Sources Say",
        "real": true,
        "explanation": "Real — US officials leaked strike readiness during the February 2026 Iran tensions.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "OpenAI Pauses ChatGPT Service for 12 Hours After Discovery of 'Alignment Drift'",
        "real": false,
        "explanation": "Fabricated. While AI safety concerns are real, no such incident occurred."
      },
      {
        "text": "Nine Skiers Still Missing After Deadly California Avalanche Near Lake Tahoe",
        "real": true,
        "explanation": "Real — rescue efforts continued for days after the February 2026 avalanche.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "UNESCO Adds New York City's Central Park to World Heritage Site List",
        "real": false,
        "explanation": "Fabricated. Central Park is not on the UNESCO World Heritage List."
      },
      {
        "text": "Ukraine-Russia Geneva Talks: Russia Demands Full NATO Withdrawal from Eastern Europe",
        "real": true,
        "explanation": "Real — Russia's maximalist demands stalled the Geneva peace process.",
        "source": "Arlo's Dispatch"
      }
    ]
  },
  {
    "day": 10,
    "date": "2026-03-02",
    "headlines": [
      {
        "text": "Iran Holds New Military Drills as USS Abraham Lincoln Closes on the Gulf",
        "real": true,
        "explanation": "Real — Iran conducted military exercises as US carrier groups moved into position.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "India's Supreme Court Rules Caste Discrimination Illegal in Private Sector Employment",
        "real": false,
        "explanation": "Fabricated. While caste discrimination is debated, no such sweeping ruling has been issued."
      },
      {
        "text": "Mikaela Shiffrin Announces Retirement from Professional Skiing After Olympic Gold",
        "real": false,
        "explanation": "Fabricated. Shiffrin won gold at the 2026 Olympics but did not announce retirement."
      },
      {
        "text": "Supreme Court Strikes Down Trump's Tariffs in Historic 6-3 Ruling on Executive Trade Power",
        "real": true,
        "explanation": "Real — the landmark February 2026 ruling limited presidential tariff authority.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "France Arrests 11 in Connection with Far-Right Activist Killing as Tensions Rise",
        "real": true,
        "explanation": "Real — French police conducted mass raids after the killing in February 2026.",
        "source": "Arlo's Dispatch"
      }
    ]
  },
  {
    "day": 11,
    "date": "2026-03-03",
    "headlines": [
      {
        "text": "Zuckerberg Admits Under Oath That Meta Prioritized Engagement Over Teen Safety",
        "real": false,
        "explanation": "Fabricated. While Zuckerberg testified about safety, he denied knowingly prioritizing engagement over teen safety."
      },
      {
        "text": "Trump's 'Board of Peace' Holds Inaugural Summit as Key Allies Decline to Attend",
        "real": true,
        "explanation": "Real — several major allies skipped Trump's new diplomatic forum.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Peru's Express Impeachment Sets Latin American Record at 47 Hours from Filing to Removal",
        "real": false,
        "explanation": "Fabricated. Peru's president was ousted quickly, but '47 hours' is an invented detail."
      },
      {
        "text": "Alysa Liu Wins Olympic Gold, Ending a 24-Year US Figure Skating Drought",
        "real": true,
        "explanation": "Real — Liu's victory was a historic moment at the 2026 Winter Olympics.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Rev. Jesse Jackson Lies in State at US Capitol as Nation Mourns Civil Rights Icon",
        "real": true,
        "explanation": "Real — Jackson was honored at the Capitol following his death in February 2026.",
        "source": "Arlo's Dispatch"
      }
    ]
  },
  {
    "day": 12,
    "date": "2026-03-04",
    "headlines": [
      {
        "text": "South Korea's Constitutional Court Upholds Yoon's Life Sentence, Bars Future Pardon",
        "real": false,
        "explanation": "Fabricated. Yoon was sentenced to life, but no constitutional court ruling on pardons has been issued."
      },
      {
        "text": "India's Reliance Commits $110 Billion to AI Infrastructure in Landmark Investment",
        "real": true,
        "explanation": "Real — one of the largest AI investments by any non-US company.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Nvidia and Meta Seal Multibillion-Dollar Chip Deal Reshaping AI Hardware Supply",
        "real": true,
        "explanation": "Real — the deal locked in massive GPU supply for Meta's AI ambitions.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "WHO Confirms New Strain of Avian Flu Has Achieved Limited Human-to-Human Transmission",
        "real": false,
        "explanation": "Fabricated. While avian flu remains a concern, no confirmed human-to-human transmission has been announced."
      },
      {
        "text": "Bangladesh's Tarique Rahman Returns from 17-Year Exile to Become Prime Minister",
        "real": true,
        "explanation": "Real — Rahman returned from exile in London to lead Bangladesh in 2026.",
        "source": "Arlo's Dispatch"
      }
    ]
  },
  {
    "day": 13,
    "date": "2026-03-05",
    "headlines": [
      {
        "text": "Iran Temporarily Closes Strait of Hormuz During Live-Fire Military Exercise",
        "real": true,
        "explanation": "Real — Iran briefly closed the world's most critical oil chokepoint.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "EU Announces Emergency Summit on Energy Security After Hungary Suspends Gas Transit",
        "real": false,
        "explanation": "Fabricated. Hungary and Slovakia suspended diesel shipments to Ukraine, but no EU emergency summit was called."
      },
      {
        "text": "Former Prince Andrew Released on Bail After Historic Arrest Over Epstein Ties",
        "real": false,
        "explanation": "Fabricated. Andrew was arrested, but the bail detail is invented."
      },
      {
        "text": "Trump Signs Executive Order Demanding Pentagon Release All UFO and Alien Files",
        "real": true,
        "explanation": "Real — part of Trump's broader transparency push on unidentified phenomena.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Eight Dead in California's Deadliest Avalanche as Climate Data Shows Snowpack Anomaly",
        "real": true,
        "explanation": "Real — the Lake Tahoe avalanche was linked to unusual snowpack conditions.",
        "source": "Arlo's Dispatch"
      }
    ]
  },
  {
    "day": 14,
    "date": "2026-03-06",
    "headlines": [
      {
        "text": "Artemis II Launches Successfully as Four Astronauts Begin Journey Around the Moon",
        "real": false,
        "explanation": "Fabricated (as of this puzzle date). Artemis II was in pre-launch quarantine, not yet launched."
      },
      {
        "text": "Trump Reimposing 10% Global Tariff Despite Supreme Court Ruling Against Executive Trade Powers",
        "real": true,
        "explanation": "Real — Trump defied the Court's ruling and signed a new tariff order.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "Geneva Nuclear Talks Collapse as Iran Walks Out Over 'Impossible' US Demands",
        "real": false,
        "explanation": "Fabricated. The talks were tense but Iran did not walk out."
      },
      {
        "text": "Hungary and Slovakia Cut Diesel Supplies to Ukraine as Energy Becomes a Weapon",
        "real": true,
        "explanation": "Real — fuel deliveries were suspended amid deepening EU divisions.",
        "source": "Arlo's Dispatch"
      },
      {
        "text": "South Korea Sentences Former President Yoon to Life for Insurrection",
        "real": true,
        "explanation": "Real — the historic sentence for Yoon's martial law declaration.",
        "source": "Arlo's Dispatch"
      }
    ]
  }
]