{
  "id": 1,
  "title": "Rev. Jesse Jackson, Towering Civil Rights Leader, Dies at 84",
  "summary": "The protégé of Martin Luther King Jr. who became a two-time presidential candidate and reshaped American politics died Tuesday in Chicago.",
  "content": "The Rev. Jesse Jackson, one of the most influential civil rights leaders in American history, died Tuesday at his home in Chicago. He was 84.\n\nJackson's life traced the arc of the modern civil rights movement itself. Born Jesse Burns into the segregated South of Greenville, South Carolina, he rose from poverty to stand on the national stage — first as a protégé of Martin Luther King Jr., then as a political force in his own right.\n\nHis 1984 and 1988 presidential campaigns were watershed moments. He was not the first Black American to seek the presidency, but he was the first to mount a serious challenge for a major party nomination. In 1988, he won 11 primaries and caucuses and nearly seven million votes, finishing second to Michael Dukakis. The path he carved led directly to Barack Obama's victory two decades later.\n\nBeyond electoral politics, Jackson spent decades as America's most visible civil rights advocate. He founded the Rainbow PUSH Coalition, negotiated the release of hostages in Syria, Cuba, and Iraq, and marched across the Edmund Pettus Bridge as recently as 2025 for the 60th anniversary of the Selma voting rights march.\n\nTributes poured in from across the political spectrum. Former President Obama called Jackson \"a trailblazer who changed what was possible in American politics.\" President Trump offered condolences, calling him \"a man of great conviction.\" Congressional leaders from both parties praised his decades of service.\n\nJackson had been battling Parkinson's disease since his diagnosis in 2017. Despite his declining health, he remained active in public life until his final months.\n\nThe writer James Baldwin once said of Jackson's presidential run that it \"presents the American Republic with questions and choices it has spent all its history until this hour trying to avoid.\" That assessment extends to Jackson's entire life — a life spent refusing to let America avoid its hardest questions about race, justice, and equality.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-17 22:01:01",
  "source_url": "https://apnews.com/article/jesse-jackson-dies-reactions-bb9961345fce4ffa94f7e540809f9989",
  "image_file": "jackson.png"
}