{
  "id": 2,
  "title": "US and Iran Report Progress in Geneva Nuclear Talks as War Threats Loom",
  "summary": "The second round of nuclear negotiations yielded 'guiding principles' for a potential deal, but fundamental disagreements over enrichment and sanctions remain.",
  "content": "The United States and Iran concluded a second round of nuclear talks in Geneva on Monday, with both sides claiming progress even as the threat of military action continues to hang over the negotiations.\n\nIran's Foreign Minister confirmed that the two sides had agreed on \"guiding principles\" for a potential nuclear deal — the first such framework since the collapse of the JCPOA in 2018. A senior US official described the talks as having \"made progress\" but cautioned that \"there are still a lot of details to discuss.\"\n\nThe talks come against a backdrop of escalating tension. The US has repeatedly threatened military action against Iran over its nuclear activities, which Western intelligence agencies believe have brought Tehran closer than ever to weapons-grade enrichment capability. Iran insists its program is peaceful.\n\nWhat makes these negotiations particularly complex is the broader geopolitical context. US envoys are simultaneously managing trilateral peace talks between Ukraine and Russia in the same city — a diplomatic juggling act that has raised questions about Washington's bandwidth and priorities.\n\nThe key sticking points remain unchanged: Iran wants comprehensive sanctions relief before agreeing to limit its enrichment program, while the US insists on verifiable restrictions first. The question of Iran's advanced centrifuges — which have brought enrichment levels to 60%, far beyond civilian needs — remains the thorniest technical issue.\n\nA third round of talks has not yet been scheduled, but both delegations described the atmosphere as \"constructive.\" Whether that constructiveness can survive the political pressures in both Washington and Tehran remains to be seen.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-17 22:01:17",
  "source_url": "https://www.reuters.com/world/europe/us-iran-set-high-stakes-nuclear-talks-geneva-threat-war-looms-2026-02-17/",
  "image_file": "iran-talks.png"
}