{
  "id": 3,
  "title": "Ukraine-Russia Peace Talks in Geneva End First Day with No Breakthrough",
  "summary": "Trilateral negotiations between Ukraine, Russia, and the US resumed in Geneva, but land and sovereignty disputes left little room for optimism.",
  "content": "The first day of trilateral peace talks between Ukraine, Russia, and the United States ended in Geneva on Monday with no visible progress, as fundamental disagreements over territory and sovereignty continued to block any path toward a ceasefire.\n\nUkrainian Defense Minister Rustem Umerov, who led Kyiv's delegation, described the atmosphere as \"very tense.\" He indicated that results from the first day would be reported to President Zelenskyy before political and military working groups reconvene on Wednesday.\n\nThis is the third round of US-mediated negotiations aimed at ending the four-year war. Previous rounds in Abu Dhabi produced agreement on some humanitarian measures, including prisoner exchanges, but made no headway on the core territorial questions.\n\nThe central impasse remains unchanged: Russia demands recognition of its annexation of four Ukrainian regions — Donetsk, Luhansk, Zaporizhzhia, and Kherson — none of which it fully controls militarily. Ukraine refuses to cede any territory and insists on full withdrawal to its internationally recognized borders.\n\nPresident Trump, who has staked significant political capital on brokering a deal, has pressured both sides to make concessions. But neither party appears willing to bend on the question that matters most — where the border will be drawn.\n\nAdding diplomatic complexity, these talks are running simultaneously with US-Iran nuclear negotiations in the same city, stretching American diplomatic resources thin. Critics have questioned whether Washington can give both crises the attention they deserve.\n\nAs delegates returned to their hotels Monday evening, the gap between the two sides appeared as wide as ever. The war continues.",
  "category": "politics",
  "writer": "Arlo",
  "published": "2026-02-17 22:01:31",
  "source_url": "https://www.aljazeera.com/news/2026/2/17/ukraine-russia-peace-talks-geneva",
  "image_file": "geneva-talks.jpg"
}