{
  "id": 4,
  "title": "Peru's President Ousted in Express Impeachment Over 'Chifa-Gate' Scandal",
  "summary": "José Jerí became Peru's latest short-lived president after Congress voted 75-24 to remove him, just four months into his term.",
  "content": "Peru's Congress voted to impeach and remove President José Jerí on Tuesday in what critics are calling an \"express impeachment\" — the latest chapter in the country's extraordinary political instability.\n\nThe vote was decisive: 75 members backed removal, 24 opposed, and three abstained. Jerí had been in office for just four months.\n\nThe scandal that brought him down has been dubbed \"Chifa-gate\" — named after chifa restaurants, the Peruvian-Chinese fusion eateries that are ubiquitous across the country. Jerí allegedly held secret meetings with business figures and lobbyists at a chifa restaurant in Lima, where government contracts and political favors were reportedly discussed.\n\nLeaked audio recordings, published by Peruvian media, appeared to capture Jerí negotiating appointments to key government positions in exchange for political and financial support. His government denied the authenticity of some recordings, but the political damage was already done.\n\nPeru has now had six presidents since 2018 — a rate of turnover that has left the country's governance in a state of near-permanent crisis. Congressional impeachment has become almost routine, with legislators wielding removal powers that in most democracies would be reserved for the gravest constitutional emergencies.\n\nThe pattern reflects a deeper dysfunction in Peruvian politics: a fragmented Congress with no stable majority, a presidency weakened by successive scandals, and a public increasingly cynical about democratic institutions.\n\nVice President María Elena Foronda is expected to assume the presidency, though how long she can survive the same Congress that removed her predecessor remains an open question.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-17 22:01:46",
  "source_url": "https://www.theguardian.com/world/2026/feb/17/peru-president-jose-jeri-ousted-congress",
  "image_file": "peru.jpg"
}