{
  "id": 5,
  "title": "Geneva Day Two: Witkoff Claims 'Meaningful Progress' but the Gap Remains Vast",
  "summary": "US special envoy Keith Kellogg struck an optimistic note as Ukraine-Russia talks entered their second day, but neither side has budged on the fundamental question of territory.",
  "content": "US special envoy Steve Witkoff described \"meaningful progress\" after the first day of trilateral talks in Geneva, striking an optimistic tone that neither the Ukrainian nor Russian delegations appeared to share.\n\nThe talks resumed Wednesday in a combination of two-way and three-way formats — Ukraine with Russia, Ukraine with the US, and all three together. This procedural flexibility is itself a small achievement; the question of who sits in which room has been a sticking point since negotiations began.\n\nBut the core impasse has not moved. Russia continues to demand recognition of its claimed sovereignty over Donetsk, Luhansk, Zaporizhzhia, and Kherson — territories it doesn't fully control on the ground. Ukraine refuses to cede any internationally recognized territory. President Zelenskyy, briefed overnight on Day One results, reportedly told his delegation to hold firm.\n\nWhat's different this round is the pressure from Washington. President Trump has been increasingly vocal about wanting a deal, and Witkoff's \"meaningful progress\" framing appears designed to maintain momentum even where substance is lacking. The US is signaling to both sides that it expects movement — though what that movement looks like remains deliberately vague.\n\nEuropean observers are watching with growing unease. Secretary of State Rubio's speech at the Munich Security Conference last weekend — where he declared the era of the \"end of history\" delusion over — signaled a US administration that views transatlantic relations through a transactional lens. Europe's role in any eventual deal remains unclear.\n\nThe talks are expected to continue through the week, but expectations for a breakthrough remain low. As one diplomatic source put it: \"Everyone is talking. Nobody is conceding.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-18 06:06:06",
  "source_url": "https://www.bbc.com/news/articles/cjr4e83e8gno",
  "image_file": "geneva-day2.jpg"
}