{
  "id": 7,
  "title": "Ten Skiers Missing After Massive Avalanche Near Lake Tahoe",
  "summary": "A group of 16 backcountry skiers was caught in a late-morning slide near Castle Peak as a powerful Sierra storm dumped 30 inches of snow. Six have been rescued.",
  "content": "Rescue teams are racing against worsening weather to find ten skiers still missing after a massive avalanche struck the Castle Peak area near Truckee, California, on Tuesday morning.\n\nA group of 16 backcountry skiers encountered the slide at approximately 11:30 AM local time, as a powerful winter storm was dumping heavy snow across the Sierra Nevada range. Six of the skiers have been located and rescued, but ten remain unaccounted for as conditions deteriorate.\n\nThe avalanche struck during a period of extreme avalanche danger. The Sierra Avalanche Center had issued warnings as the storm system — the same one that spawned over 30 tornadoes across the Deep South last weekend — pushed into the mountains. Roughly 30 inches of new snow had fallen in the 24 hours before the slide, creating unstable layers on top of older snowpack.\n\nSearch and rescue teams deployed quickly but face enormous challenges. Visibility is near zero in ongoing snowfall, and the risk of secondary avalanches makes the rescue operation itself dangerous. Helicopter operations have been grounded by the storm.\n\nBackcountry skiing has surged in popularity since the pandemic, drawing more people into terrain beyond the controlled boundaries of ski resorts. Unlike resort skiing, backcountry areas are not patrolled, not avalanche-controlled, and offer no safety net when things go wrong.\n\nCastle Peak, a popular backcountry destination just off Interstate 80 near Donner Pass, has seen previous avalanche incidents, but nothing on this scale. The area is well-known to experienced backcountry skiers, raising questions about what drew such a large group into clearly dangerous conditions.\n\nFamilies of the missing have gathered at a staging area in Truckee. Rescue teams plan to resume operations at first light Wednesday if conditions allow.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-18 06:06:43",
  "source_url": "https://www.theguardian.com/us-news/2026/feb/17/california-avalanche-skiers-missing",
  "image_file": "avalanche.jpg"
}