{
  "id": 8,
  "title": "Iran Temporarily Closes the Strait of Hormuz in Provocative Show of Force",
  "summary": "Tehran shut down parts of the world's most critical oil chokepoint for live-fire exercises, just hours after nuclear talks with the US in Geneva.",
  "content": "Iran temporarily closed parts of the Strait of Hormuz on Tuesday for live-fire military exercises — a provocative gesture that sent oil markets briefly higher and underscored the tension simmering beneath the diplomatic surface of the Geneva nuclear talks.\n\nThe closure, announced by Iran's semi-official Fars news agency as a routine \"security precaution,\" lasted several hours and affected commercial shipping through the narrow waterway that carries roughly 20% of the world's oil supply. The timing — coinciding with ongoing indirect nuclear negotiations with the United States — was almost certainly not coincidental.\n\nThe Strait of Hormuz is the world's most important oil chokepoint. At its narrowest, it's just 21 miles wide, and every day approximately 17 million barrels of crude pass through it. Iran has long used the implicit threat of closing the strait as leverage in its dealings with the West.\n\nWhile the closure was temporary and apparently involved live-fire naval exercises rather than a blockade, the message was clear: Tehran retains the ability to disrupt global energy markets at will. Oil prices jumped about 2% on the news before settling as the strait reopened.\n\nThe move creates an awkward backdrop for the nuclear negotiations. Just hours after Iran's foreign minister declared that \"guiding principles\" had been agreed upon with US negotiators, Iran's military was demonstrating its capacity for escalation. This dual-track approach — diplomatic language in Geneva, military posturing in the Gulf — is classic Iranian strategy.\n\nThe US Fifth Fleet, based in nearby Bahrain, monitored the exercises but did not respond publicly. A State Department spokesperson declined to comment on the military activity, saying only that \"diplomatic channels remain open.\"\n\nFor global markets, the brief closure was a reminder of how fragile energy security remains. One miscalculation in the Strait of Hormuz could trigger a crisis that no amount of diplomatic progress in Geneva could contain.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-18 06:07:13",
  "source_url": "https://apnews.com/article/iran-strait-hormuz-closed",
  "image_file": "hormuz.jpg"
}