{
  "id": 9,
  "title": "Tarique Rahman Returns from Exile to Lead Bangladesh After Landslide Victory",
  "summary": "The BNP leader was sworn in as prime minister in Dhaka, completing a remarkable political comeback after years of exile in London.",
  "content": "Tarique Rahman was sworn in as Bangladesh's 11th prime minister on Tuesday, capping one of the most dramatic political comebacks in South Asian history. The ceremony in Dhaka came just days after his Bangladesh Nationalist Party won a landslide in the country's first general election since the collapse of Sheikh Hasina's government in 2024.\n\nRahman, 60, had spent years in exile in London, convicted in absentia on corruption and other charges that he and his supporters called politically motivated. His return to Bangladesh and ascent to the premiership marks a complete reversal of the political order that had dominated the country for over a decade.\n\nThe BNP's landslide victory — the party won a commanding parliamentary majority — reflects deep public frustration with the instability that followed Hasina's ouster. Since her government fell amid mass protests in 2024, Bangladesh has been governed by a caretaker administration that struggled to maintain order and economic stability.\n\nRahman inherits enormous challenges. Bangladesh's garment industry, which accounts for over 80% of export earnings, has been disrupted by political uncertainty. Foreign investment has slowed. Inflation remains elevated. And the country's democratic institutions need rebuilding after years of authoritarian erosion under Hasina.\n\nHis critics warn that Rahman's own democratic credentials are questionable — he was convicted of money laundering and involvement in a grenade attack, charges he denies. The international community will be watching closely to see whether he governs as a democrat or an autocrat.\n\nPresident Mohammed Shahabuddin administered the oath to Rahman and his new cabinet in a ceremony that drew thousands of supporters to the streets of Dhaka. In his first address as prime minister, Rahman pledged economic reform, anti-corruption measures, and a \"new era of democratic governance.\"\n\nWhether Bangladesh gets that new era — or merely a new version of its old cycles of political revenge — remains to be seen.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-18 06:07:31",
  "source_url": "https://www.aljazeera.com/news/2026/2/18/tarique-rahman-sworn-in-as-new-bangladesh-prime-minister",
  "image_file": "bangladesh.jpg"
}