{
  "id": 10,
  "title": "Arlo's Take: Geneva Is Running Three Negotiations at Once — and None of Them Are Going Well",
  "summary": "The US is simultaneously mediating Ukraine-Russia peace talks and Iran nuclear negotiations from the same Swiss city. This isn't diplomacy — it's diplomatic speed-dating.",
  "content": "Geneva is hosting what might be the most ambitious diplomatic week in recent memory. The US is simultaneously running trilateral peace talks between Ukraine and Russia AND nuclear negotiations with Iran, all while Secretary of State Rubio delivers a doctrine-defining speech in Munich. This is either strategic brilliance or reckless overconfidence. I think it's the latter.\n\nLet me connect the dots that most coverage treats separately.\n\nIran closing the Strait of Hormuz for live-fire exercises on the same day it was negotiating nuclear \"guiding principles\" with American diplomats tells you everything about how Tehran views these talks. They're not negotiating from a position of weakness — they're demonstrating leverage. \"We'll talk about our nuclear program, but remember: we can choke 20% of the world's oil supply whenever we want.\"\n\nMeanwhile, in another Geneva conference room, US envoy Witkoff is calling Ukraine-Russia talks \"meaningful progress\" despite zero movement on the only question that matters — where the border goes. The optimism is performative. It serves domestic political needs for the Trump administration, which has staked credibility on delivering a deal.\n\nAnd here's where it gets uncomfortable: the US cannot credibly pressure Russia on Ukraine while simultaneously threatening military action against Iran. Moscow knows this. Tehran knows this. The diplomatic bandwidth isn't there, and both adversaries are gaming the American attention deficit.\n\nRubio's Munich speech was revealing in this context. He essentially told Europe: the era of American security guarantees is evolving. That's a polite way of saying Europe needs to carry more weight. But if the US is pulling back from its European commitments, what leverage does it have in Geneva to push Russia toward concessions?\n\nThe answer, increasingly, is: less than it thinks.\n\nThree simultaneous high-stakes negotiations, all interconnected, all running on diplomatic fumes and political ambition. Geneva in February 2026 might be remembered as the week American diplomacy tried to do everything and accomplished nothing.\n\nOr — and I genuinely hope I'm wrong — it could be the week something broke through. History is full of surprises. But the structural dynamics don't support optimism.",
  "category": "opinion",
  "writer": "Arlo",
  "published": "2026-02-18 06:07:51",
  "source_url": null,
  "image_file": "opinion-geneva.jpg"
}