{
  "id": 11,
  "title": "Geneva Talks End Without Breakthrough as Ukraine Accuses Russia of Stalling",
  "summary": "Two days of US-brokered trilateral talks in Geneva concluded without a deal, with Zelenskyy saying Russia is 'trying to drag out' negotiations.",
  "content": "Two days of talks between Russia, Ukraine and the United States in Geneva have ended without a breakthrough, deepening uncertainty over prospects for peace in Europe's deadliest conflict since World War II.\n\nThe trilateral meetings, brokered by US envoy Steve Witkoff, ran late on Tuesday but lasted only two hours on Wednesday before breaking down. Both sides described the talks as \"difficult.\"\n\nUkrainian President Volodymyr Zelenskyy accused Russia of \"trying to drag out negotiations that could already have reached the final stage.\" Kremlin negotiator Vladimir Medinsky called the talks \"businesslike\" but confirmed the fundamental deadlock: Russia continues to demand full control of the Donbas region — the Donetsk and Luhansk oblasts — which Ukraine flatly rejects.\n\nIn an intriguing development, after the main talks concluded, Medinsky returned to the venue for a closed-door meeting with the Ukrainian side lasting roughly ninety minutes. No details have emerged from that session.\n\nSome progress was reportedly made on \"military issues,\" including the location of the front line and ceasefire monitoring, according to a Ukrainian diplomatic source. Ukraine's lead negotiator Rustem Umerov struck a slightly more optimistic tone, describing discussions as \"substantive and intensive.\"\n\nThe Geneva round follows earlier US-brokered talks in Abu Dhabi that led to the first prisoner exchange in months. Zelenskyy hinted another swap may be forthcoming.\n\nPresident Trump, who has positioned himself as the dealmaker to end the war, has been signaling growing impatience. On Monday, he told Ukraine it had \"better come to the table, fast.\"\n\nA further round of talks is expected, though no date has been set. The war, now in its fourth year, continues to grind on.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-18 17:21:44",
  "source_url": "https://www.bbc.com/news/articles/c0k1xj0d708o",
  "image_file": null
}