{
  "id": 14,
  "title": "Erdogan Rejects Israel's Recognition of Somaliland, Warns of Regional Instability",
  "summary": "Turkey's president says the Horn of Africa 'should not be the battlefield of foreign forces' as geopolitical tensions simmer over Somaliland's status.",
  "content": "Turkish President Recep Tayyip Erdogan has publicly rejected Israel's recognition of Somaliland as an independent nation, warning that the move could prove dangerous for an already volatile region.\n\nSpeaking at a joint press conference in Addis Ababa with Ethiopian Prime Minister Abiy Ahmed, Erdogan declared: \"The Horn of Africa should not be the battlefield of foreign forces. We believe that countries of the region should address their problems by themselves.\"\n\nIsrael became the first country to recognize Somaliland in December, a diplomatic move that angered Mogadishu, which still considers the breakaway region part of its territory. Somaliland declared independence from Somalia more than 30 years ago but has struggled to gain international recognition.\n\nErdogan's intervention carries particular weight: Turkey has become an increasingly important geopolitical player in the Horn of Africa, and it was Erdogan who mediated an end to a 2024 dispute between Ethiopia and Somalia over plans for Ethiopia to lease Somaliland coastline for a port.\n\nSomaliland's foreign ministry responded by urging Turkey to \"refrain from inflaming regional tensions.\"\n\nMeanwhile, Ethiopian PM Abiy Ahmed used the occasion to press his own agenda, urging Turkey to support Ethiopia's quest for sea access. Since Eritrea's secession in 1993, landlocked Ethiopia — with a population exceeding 130 million — has been without direct access to the Red Sea.\n\nThe overlapping interests of Israel, Turkey, Ethiopia, and Somalia in this strategically vital corner of Africa highlight how Somaliland's status has become a proxy for broader great-power competition.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-18 17:21:44",
  "source_url": "https://www.bbc.com/news/articles/c0lj0plkg09o",
  "image_file": null
}