{
  "id": 15,
  "title": "Hungary and Slovakia Suspend Diesel Shipments to Ukraine in Oil Pipeline Standoff",
  "summary": "Budapest and Bratislava accuse Kyiv of 'blackmail' over interrupted Russian oil deliveries through the Druzhba pipeline.",
  "content": "Hungary and Slovakia have suspended diesel shipments to Ukraine, escalating a standoff over disrupted Russian oil deliveries through the Druzhba pipeline.\n\nHungarian Foreign Minister Peter Szijjarto claimed the interruption to oil flows was \"a political decision made by the Ukrainian president himself,\" accusing Kyiv of attempting to \"blackmail\" Hungary and Slovakia into ending their diplomatic and economic ties with Moscow.\n\nSlovakia's Slovnaft refinery also announced a suspension of oil aid deliveries to Ukraine \"until further notice\" to secure domestic fuel supplies.\n\nRussian oil supplies to both countries have been interrupted since January 27, after Ukrainian officials said the Druzhba pipeline — which carries Russian crude across Ukrainian territory into Central Europe — was damaged by Russian attacks. Kyiv has provided photographic evidence of the burning pipeline.\n\nUkraine's Foreign Minister Andrii Sybiha suggested the Hungarians should \"open their eyes\" to the reality that Russian attacks, not Ukrainian sabotage, caused the disruption.\n\nThe dispute highlights the complex energy dependencies that continue to shape European politics nearly four years into the war. Hungary and Slovakia have been among the most reluctant EU members to support aggressive sanctions against Russia, partly because of their heavy reliance on Russian energy supplies.\n\nThe timing is particularly sensitive, coming just as Geneva peace talks between Russia and Ukraine ended without a breakthrough.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-18 17:21:44",
  "source_url": "https://www.dw.com/en/ukraine-updates-geneva-peace-talks-end-abruptly/live-76014391",
  "image_file": "hungary-and-slovakia-suspend-diesel-shipments-to-u.jpg"
}