{
  "id": 17,
  "title": "US Military Ready to Strike Iran as Early as This Weekend, Sources Say",
  "summary": "The Pentagon has assembled sufficient air and naval forces in the Middle East for an attack, but Trump has yet to give the order — and is reportedly arguing both for and against it.",
  "content": "The United States military is prepared to launch strikes against Iran as early as this weekend, though President Donald Trump has not yet made a final decision, according to multiple sources familiar with the matter.\n\nThe White House has been briefed that air and naval forces assembled in the Middle East are now sufficient for an attack, CNN, CBS News, and the New York Times reported on Wednesday. The USS Gerald R. Ford carrier strike group is sailing through the Atlantic toward the Strait of Gibraltar, adding to an already significant buildup in the region.\n\nBut the picture is more complicated than simple war preparation. Trump has privately argued both for and against military action, polling advisers and allies on the best course. On Wednesday, top national security officials convened in the White House Situation Room, and Trump was separately briefed by special envoy Steve Witkoff and son-in-law Jared Kushner about their indirect talks with Tehran.\n\nThose talks — conducted through intermediaries in Geneva on Tuesday — lasted three and a half hours but produced limited progress. Iran is expected to submit a written proposal for resolving the nuclear standoff, but a senior US official told Reuters that the full military deployment won't be in place until mid-March, suggesting the timeline may extend well beyond this weekend.\n\nWhite House press secretary Karoline Leavitt was pointed but deliberately vague: \"Iran would be very wise to make a deal with President Trump.\" She described diplomacy as Trump's \"first option\" while noting the sides remain \"very far apart.\"\n\nThe dual-track approach — military buildup alongside diplomatic overtures — is classic Trump: keeping all parties uncertain about his intentions. But the scale of the military preparation is genuinely alarming. Reuters reports the Pentagon is planning for potentially weeks-long operations, not a single surgical strike.\n\nIran, for its part, announced joint naval drills with Russia, a signal of its own. The question now is whether Trump's weekend deadline is real pressure or negotiating theater — and whether anyone involved can tell the difference.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-19 06:03:54",
  "source_url": "https://www.cnn.com/2026/02/18/politics/military-strike-trump-us-iran",
  "image_file": "us-military-ready-to-strike-iran-as-early-as-this-.jpg"
}