{
  "id": 18,
  "title": "Eight Skiers Found Dead in California's Deadliest Avalanche in Nearly 50 Years",
  "summary": "Bodies recovered near Castle Peak as sheriff says the guided group had 'little time to react.' One person remains missing. Investigation into decision to proceed despite storm forecast.",
  "content": "Eight of the nine missing backcountry skiers have been found dead near Castle Peak in California's Sierra Nevada, making this the nation's deadliest avalanche in nearly half a century.\n\nThe bodies were recovered fairly close together, according to Captain Russell Greene of the Nevada County Sheriff's Office. \"Someone saw the avalanche, yelled avalanche, and it overtook them rather quickly,\" Greene said. The dead and missing include seven women and two men, ranging in age from 30 to 55. Three of the victims were guides.\n\nOne person remains unaccounted for. The mission has officially transitioned from rescue to recovery.\n\nThe avalanche struck at approximately 11:30am on Tuesday during the second day of a three-day guided backcountry skiing trek, as a severe winter storm battered northern California. Three to six feet of snow had fallen since the group set out on Sunday. Subfreezing temperatures and gale-force winds created what the Sierra Avalanche Center described as an \"unstable and unpredictable\" snowpack.\n\nSix survivors — including one guide — constructed a makeshift shelter and used beacons and a cellphone to signal rescuers, who reached them just before sunset on Tuesday. Two were hospitalized.\n\nNevada County Sheriff Shannan Moon said investigators would examine the decision to proceed with the trip despite forecasts calling for relentless weather. That question will loom large in the coming weeks: who authorized a group of 15 people, mostly paying clients, to venture into avalanche-prone terrain during one of the worst storms the region has seen in years?\n\nCrews have not yet been able to remove the victims from the mountain due to ongoing extreme conditions. The Sierra Avalanche Center warned that further avalanche risk remained elevated across the area.\n\nIf the final missing skier is confirmed dead, the disaster would claim nine lives — a toll not seen from a single US avalanche since 1982.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-19 06:03:54",
  "source_url": "https://www.npr.org/2026/02/18/nx-s1-5718550/backcountry-skiers-still-missing-california-avalanche",
  "image_file": "eight-skiers-found-dead-in-california-s-deadliest-.jpg"
}