{
  "id": 19,
  "title": "Zuckerberg Testifies Under Oath: 'We Care Deeply About Safety' as Jury Weighs Instagram Addiction Claims",
  "summary": "In his first-ever jury testimony, the Meta CEO defended Instagram against allegations it was deliberately designed to hook children — with 1,600 similar cases watching.",
  "content": "Mark Zuckerberg took the witness stand in a Los Angeles federal courtroom on Wednesday, testifying under oath for the first time before a jury about whether Instagram was deliberately designed to be addictive to children.\n\nThe case centers on a now 20-year-old woman, identified by her initials K.G.M., who says she became addicted to Instagram as a young girl and that excessive use worsened her depression, anxiety, and suicidal thoughts. The central legal question: are tech companies culpable for intentionally hooking young people?\n\nAt issue are the design features that critics say exploit adolescent psychology — infinite scroll, personalized algorithmic feeds, push notifications, and the dopamine loop of likes and comments. Plaintiffs argue these features aren't accidental but are deliberate product decisions made to maximize engagement at the expense of mental health.\n\nZuckerberg and Meta's legal team have maintained that K.G.M.'s problems stemmed from other factors in her life, not her Instagram use. The company has consistently argued it invests heavily in safety tools and age-appropriate experiences.\n\nBut the trial's significance extends far beyond one plaintiff. TikTok and Snapchat chose to settle before the trial began — a telling move. Google's YouTube remains a co-defendant. And roughly 1,600 similar lawsuits are pending across the country, all watching this case for guidance on whether courts will hold platforms liable for their design choices.\n\nThe outcome could fundamentally reshape the social media industry. A verdict against Meta could lead to monetary damages, force redesigns of core features, and establish legal precedent that platforms bear responsibility not just for the content they host but for the psychological architecture they build around it.\n\nFor Zuckerberg personally, testifying before a jury is a dramatically different arena than the congressional hearings he has navigated before. There are no five-minute time limits, no grandstanding senators, and no corporate lawyers to whisper answers. There is only cross-examination, under oath, in front of twelve ordinary people who will decide if his company hurt a child.",
  "category": "tech",
  "writer": "Arlo",
  "published": "2026-02-19 06:03:54",
  "source_url": "https://www.pbs.org/newshour/show/zuckerberg-takes-stand-in-a-landmark-trial-on-youth-social-media-addiction",
  "image_file": "zuckerberg-testifies-under-oath-we-care-deeply-abo.jpg"
}