{
  "id": 22,
  "title": "Former Prince Andrew Arrested on Suspicion of Misconduct Linked to Epstein Files",
  "summary": "Andrew Mountbatten-Windsor, King Charles III's younger brother, was arrested Thursday by British police on suspicion of misconduct in public office — the most dramatic consequence yet of the Epstein files release.",
  "content": "British police arrested Andrew Mountbatten-Windsor on Thursday morning on suspicion of misconduct in public office, marking the most significant arrest yet to emerge from the ongoing investigation into the Jeffrey Epstein files.\n\nAndrew, who was stripped of his royal title last year over his long-documented friendship with the late convicted sex offender Jeffrey Epstein, was taken into custody at his residence. Metropolitan Police confirmed the arrest in a brief statement, saying the inquiry relates to suspected criminal activity revealed in documents released as part of the Epstein files.\n\nThe arrest caps years of mounting pressure on the former Duke of York. Andrew settled a civil sexual abuse lawsuit in 2022, paying millions to Virginia Giuffre, but always denied wrongdoing. His disastrous 2019 BBC Newsnight interview, in which he claimed he couldn't sweat and recalled a visit to Pizza Express in Woking, became one of the most-watched car crashes in royal interview history.\n\nThe Epstein files, gradually released over the past two years, have revealed an extensive web of connections between Epstein and powerful figures in politics, business, and royalty. Andrew's name appeared repeatedly. British investigators, initially seen as reluctant to pursue a member of the royal family, appear to have found evidence that crossed the threshold from embarrassing to criminal.\n\nMisconduct in public office is a serious charge under English law, carrying a maximum sentence of life imprisonment. It applies to public officeholders who willfully neglect their duty or willfully engage in misconduct. The specific allegations against Andrew have not yet been made public.\n\nBuckingham Palace has not issued a statement. Andrew's legal team said he would cooperate fully with authorities.\n\nThe arrest sent shockwaves through Britain. Anti-monarchy campaigners called it long overdue. Supporters of the royal family expressed shock. Legal analysts noted that an actual prosecution would be unprecedented in modern British history — no member of the royal family has faced criminal charges in living memory.\n\nFor King Charles, the arrest presents yet another crisis for an institution already strained by the departure of Harry and Meghan, the death of Queen Elizabeth, and declining public support among younger Britons. The palace had hoped that stripping Andrew of his titles would create sufficient distance. Today proved otherwise.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-19 14:30:00",
  "source_url": "https://www.nbcnews.com/world/united-kingdom/former-prince-andrew-arrested-epstein-files-revelations-rcna259691",
  "image_file": "prince-andrew-arrested-epstein.jpg"
}