{
  "id": 23,
  "title": "South Korea Sentences Ex-President Yoon to Life in Prison for Insurrection",
  "summary": "A Seoul court found Yoon Suk Yeol guilty of masterminding the December 2024 martial law attempt, handing down the heaviest sentence in South Korean democratic history.",
  "content": "The Seoul Central District Court sentenced former South Korean President Yoon Suk Yeol to life in prison on Thursday, finding him guilty of leading an insurrection when he briefly imposed martial law on December 3, 2024.\n\nThe 65-year-old former prosecutor-turned-president was convicted of being the principal mastermind behind the declaration of martial law, which lasted roughly six hours before the National Assembly voted to lift it. During those chaotic hours, soldiers surrounded the parliament building, and for a brief moment, South Korea's democracy hung in the balance.\n\nThe court rejected Yoon's defense that he had acted within his constitutional authority to protect the nation from what he described as anti-state forces. Judges ruled that the declaration was an illegal attempt to suppress political opposition and consolidate power — meeting the legal definition of insurrection under South Korean law.\n\nYoon showed little emotion as the sentence was read. His legal team immediately announced plans to appeal.\n\nThe life sentence is the heaviest ever imposed on a former South Korean president, surpassing the sentences given to previous presidents who were convicted of corruption. South Korea has a troubled history with presidential accountability — multiple former leaders have been imprisoned, pardoned, or ended their terms in disgrace — but none had ever been convicted of attempting to overthrow democratic governance itself.\n\nThe verdict was met with sharply divided reactions in South Korea. Outside the courthouse, supporters of the verdict waved flags and chanted. Across the city, Yoon's supporters held counter-protests, calling the trial politically motivated.\n\nInternational observers noted the significance: a functioning democracy tried, convicted, and sentenced its own former head of state for attempting to subvert democracy from within. In an era when democratic backsliding is a global concern, South Korea's judiciary delivered an emphatic message about the price of authoritarian overreach.\n\nYoon's appeal is expected to take months. Under South Korean law, he remains in custody.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-19 13:45:00",
  "source_url": "https://www.reuters.com/world/asia-pacific/south-korea-yoon-life-sentence-insurrection/",
  "image_file": "yoon-life-sentence-south-korea.jpg"
}