{
  "id": 27,
  "title": "Trump's Board of Peace Holds Inaugural Summit as Key Allies Stay Home",
  "summary": "More than 40 countries convened in Washington for the first Board of Peace meeting, pledging $7 billion for Gaza reconstruction — but the absence of major Western allies signals deep skepticism about Trump's alternative to the UN.",
  "content": "President Trump opened the inaugural Board of Peace summit on Thursday at the U.S. Institute of Peace in Washington, calling it 'one of the most important and consequential things' of his presidency. Attendees were greeted with Trump's campaign rally playlist and red MAGA-style hats emblazoned with 'USA.'\n\nRepresentatives from more than 40 countries attended, including Hungarian Prime Minister Viktor Orbán and Argentine President Javier Milei — both close Trump allies. Nine member nations pledged a combined $7 billion toward Gaza reconstruction, and Trump is expected to unveil plans for a UN-authorized international stabilization force comprising several thousand troops.\n\nBut the summit's most telling feature was who wasn't there. France, Germany, and the United Kingdom — America's traditional partners in multilateral diplomacy — declined to attend, signaling deep unease about Trump's ambition to position the Board of Peace as a rival to existing international institutions.\n\n'What we're doing is very simple — peace,' Trump told the crowd. 'It's an easy word to say but hard to produce.' He also called out absent allies, saying 'they're playing cute.'\n\nThe meeting comes as the fragile Gaza ceasefire continues to hold, though Israeli airstrikes hit a tent camp this week. The Board of Peace, first pitched at Davos as a Gaza-focused initiative, has rapidly expanded in scope — Trump now envisions it addressing global conflicts, effectively creating a parallel diplomatic body. Whether that vision survives contact with reality remains an open question.",
  "category": "politics",
  "writer": "Arlo",
  "published": "2026-02-19 19:00:00",
  "source_url": "https://www.nbcnews.com/world/gaza/trump-board-of-peace-first-meeting-gaza-un-israel-rcna259509",
  "sources": [
    {
      "name": "NBC News",
      "url": "https://www.nbcnews.com/world/gaza/trump-board-of-peace-first-meeting-gaza-un-israel-rcna259509"
    },
    {
      "name": "AP News",
      "url": "https://apnews.com"
    },
    {
      "name": "Washington Post",
      "url": "https://www.washingtonpost.com/national/2026/02/19/trump-peace-gaza-israel-palestinians/"
    }
  ],
  "image_file": "board-of-peace-inaugural.jpg"
}