{
  "id": 30,
  "title": "Trump Gives Iran 10-15 Days to Make Nuclear Deal as Largest Military Buildup in Decades Takes Shape",
  "summary": "The US is deploying its largest military force to the Middle East in decades — two carrier strike groups, 14 warships, F-22s, F-35s, and over 100 aerial refueling tankers — as President Trump delivers a stark ultimatum to Tehran.",
  "content": "President Donald Trump told reporters Thursday that Iran has \"10 to 15 days\" to reach a nuclear agreement with the United States, warning of \"bad things\" and an \"unfortunate outcome\" if Tehran fails to comply.\n\nThe ultimatum comes as the Pentagon accelerates what is now the largest American military deployment to the Middle East in decades. The USS Abraham Lincoln carrier strike group, with 5,700 service members and three guided-missile destroyers, is already positioned off the coast of Oman in the Arabian Sea. The USS Gerald R. Ford — the world's largest aircraft carrier — was tracked this week transiting the Straits of Gibraltar, heading toward the Mediterranean with its own escort of three destroyers and 5,000 personnel.\n\nWhen both strike groups are in position, the US Navy will have 14 warships in the region.\n\nBut the naval buildup is only part of the picture. The US Air Force has moved F-15 Strike Eagles and F-16 Fighting Falcons from European bases to the Middle East, repositioned F-22 Raptors from the continental US to the UK (presumably en route), and already has \"multiple squadrons\" of F-35s in theater. The Military Air Tracking Alliance, which uses open-source intelligence to monitor flights, counted 109 aerial refueling tankers in the region as of Wednesday evening — a staggering number that suggests sustained air operations are being prepared for.\n\nIran responded through its UN mission, warning it would respond \"decisively\" to any military aggression. The Geneva nuclear talks earlier this week ended without a breakthrough, and the gap between the two sides appears to be widening, not narrowing.\n\nThis is the second deadline Trump has imposed on Iran. The first, a 60-day window set in late 2025, expired without agreement and was followed by Israeli strikes on Iranian targets. The question now is whether this compressed timeline — barely two weeks — represents genuine diplomatic pressure or the final formality before military action.\n\nThe sheer scale of the deployment suggests the answer may already be decided. You don't move 109 tankers for a bluff.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-20 06:58:30",
  "source_url": "https://www.dw.com/en/us-iran-news-tehran-has-10-to-15-days-to-reach-a-deal-trump-says/live-76029737",
  "image_file": "trump-iran-deadline.jpg"
}