{
  "id": 31,
  "title": "Prince Andrew Arrested Over Epstein Ties in Historic First for British Royals",
  "summary": "Andrew Mountbatten-Windsor was arrested at Sandringham on suspicion of misconduct in public office — the first arrest of a member of the British royal family in modern history. King Charles said the law must take its course.",
  "content": "In an extraordinary moment for the British monarchy, Andrew Mountbatten-Windsor — formerly Prince Andrew — was arrested at the King's Sandringham estate at 8:00 AM on Thursday by Thames Valley Police on suspicion of misconduct in public office.\n\nThe arrest relates to Andrew's long-documented association with the late sex offender Jeffrey Epstein, whose extensive files were released by the US government. Communications between the two featured prominently in the tranche. Police said a formal investigation had been opened following a \"thorough assessment.\"\n\nAndrew was photographed slumped in the back seat of a vehicle after leaving Aylsham Police Station, where he was later released under investigation. Uniformed officers were also seen searching Royal Lodge in Windsor Great Park, his former residence.\n\nKing Charles III issued a statement saying the \"law must take its course\" and that the police had his \"full and wholehearted support and co-operation.\" Thames Valley Police contacted the Home Office in advance of the arrest to give warning.\n\nThe arrest is not in relation to sexual offences, police clarified, though they are separately assessing an allegation that a second woman was sent to the UK by Epstein for a sexual encounter with Andrew in 2010.\n\nAndrew has consistently and strenuously denied any wrongdoing.\n\nThis is believed to be the first arrest of a senior member of the British royal family in modern history. The speed of events — from the Epstein file release to formal arrest — has stunned royal watchers and legal observers alike. The question now facing the monarchy is how much further the investigation will reach, and whether the institution can maintain its carefully managed distance from the scandal that has followed Andrew for years.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-20 06:58:45",
  "source_url": "https://www.bbc.com/news/articles/cx28yel4811o",
  "image_file": "prince-andrew-arrest.jpg"
}