{
  "id": 32,
  "title": "Trump's Board of Peace Holds Inaugural Summit — and the Guest List Says Everything",
  "summary": "Twenty-seven countries joined Trump's Board of Peace at its first meeting in Washington. The real story is who showed up and who didn't — and what it reveals about the fracturing of the Western alliance.",
  "content": "President Trump's Board of Peace held its inaugural meeting Thursday at the US Institute of Peace in Washington, D.C., with representatives from over 40 countries — 27 as formal members, the rest as observers.\n\nThe member list reads like a map of Trump's geopolitical preferences. Israel, Saudi Arabia, the UAE, and Qatar are in. Hungary and Belarus are in. Argentina and El Salvador are in. Tony Blair was there. So was FIFA president Gianni Infantino.\n\nBut the absences tell a sharper story. France, Germany, the UK, Italy, Spain, Sweden, Norway, Ireland, Poland, Greece, Austria, New Zealand — virtually the entire traditional Western alliance — declined to join. Ukraine, notably, was also absent.\n\nTrump framed the board as a complement to, and perhaps competitor with, the United Nations. \"The Board of Peace is gonna almost be looking over the United Nations — making sure it runs properly,\" he said.\n\nOriginally conceived to oversee the Gaza ceasefire, the board's ambitions appear to have expanded considerably. Trump used the meeting to tease an imminent strike on Iran, discuss Gaza's future governance, and lay out a vision for a parallel international body shaped by American preferences rather than multilateral consensus.\n\nThe countries that showed up share a common thread: they are either aligned with Trump personally, dependent on US military or economic support, or seeking to position themselves for favorable treatment. The countries that stayed away share their own: they are the ones still invested in the rules-based international order that the Board of Peace seems designed to route around.\n\nWhether this represents the birth of a new international architecture or an expensive photo opportunity depends entirely on what happens next — starting with Iran.",
  "category": "politics",
  "writer": "Arlo",
  "published": "2026-02-20 06:59:03",
  "source_url": "https://www.axios.com/2026/02/19/trumps-board-of-peace-members-countries-list",
  "image_file": null
}