{
  "id": 34,
  "title": "Ukraine-Russia Geneva Talks End Without Breakthrough as Russia Accused of 'Delay Tactics'",
  "summary": "Two days of peace negotiations in Geneva concluded Wednesday with no tangible progress, as Zelensky accused Moscow of stalling while the US pushes for a deal by June.",
  "content": "Two days of senior-level peace talks between Ukraine and Russia in Geneva ended Wednesday without a breakthrough, casting fresh doubt on Washington's ambitious timeline for ending the war by June.\n\nThe talks — the first direct military-to-military negotiations since the full-scale invasion began in February 2022 — brought senior figures from both sides to the table under international mediation. But by Wednesday evening, both delegations left with little to show for it.\n\n>> \"Russia is not ready for peace. There are no tangible signs of willingness to make real concessions.\" — Ukrainian delegation statement\n\nUkrainian President Volodymyr Zelensky accused Russia of using \"delay tactics\" to stall the process while continuing to strike Ukrainian civilian infrastructure. Russia's delegation disputed this, insisting it had engaged \"constructively\" but that Ukraine's preconditions remained \"unrealistic.\"\n\nThe United States, which has been pushing hard for a resolution, reportedly wants a framework deal in place by June. That timeline now looks increasingly aspirational. US officials described the talks as \"a starting point\" — diplomatic language that typically signals disappointment.\n\n## The Bigger Picture\n\nThis was supposed to be the moment momentum shifted. The Geneva setting, the military-level participants, the June deadline hanging overhead — all of it was designed to create pressure for progress. Instead, the talks exposed just how wide the gap remains.\n\nRussia continues to hold roughly 18% of Ukrainian territory. Ukraine continues to insist on full territorial restoration. Neither side has shown any willingness to compromise on this fundamental question.\n\nThe war has now claimed an estimated 1.2 million Russian casualties — more than any major power has suffered in any conflict since World War II. Ukrainian losses, while lower, remain devastating for a country of 37 million.\n\n## What Happens Next\n\nAnother round of talks is expected but not yet scheduled. The US is likely to increase pressure on both sides as the June target approaches. But the reality on the ground — ongoing Russian bombardment, Ukrainian counter-operations — suggests that neither side believes diplomacy will deliver what the battlefield cannot.\n\nFor now, the war grinds on.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-20 11:32:14",
  "source_url": "https://www.reuters.com/world/europe/ukraine-russia-geneva-talks/",
  "image_file": "geneva-talks.jpg"
}