{
  "id": 37,
  "title": "Supreme Court Strikes Down Trump's Tariffs in Historic 6-3 Ruling",
  "summary": "The Supreme Court rules that President Trump exceeded his authority by using a national emergency law to impose sweeping tariffs — a rare rebuke from a conservative-majority court against a president of its own ideological stripe.",
  "category": "politics",
  "writer": "Arlo",
  "published": "2026-02-20 19:30:00",
  "source_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-strikes-trumps-tariffs-major-blow-president-rcna244827",
  "sources": [
    {"name": "NBC News", "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-strikes-trumps-tariffs-major-blow-president-rcna244827"},
    {"name": "BBC News", "url": "https://www.bbc.com/news/live/c0l9r67drg7t"},
    {"name": "SCOTUSblog", "url": "https://www.scotusblog.com/2026/02/supreme-court-strikes-down-tariffs/"}
  ],
  "image_file": "scotus-tariffs.jpg",
  "content": "The Supreme Court delivered the most consequential economic ruling of the Trump presidency on Friday, striking down the president's sweeping tariff regime in a 6-3 decision that found he had exceeded his constitutional authority.\n\nChief Justice John Roberts authored the majority opinion, joined by an unusual coalition: conservative Justices Neil Gorsuch and Amy Coney Barrett alongside the three liberal justices. Justices Clarence Thomas, Brett Kavanaugh, and Samuel Alito dissented.\n\nThe case centered on whether the International Emergency Economic Powers Act — a 1977 law designed for national emergencies — authorized the president to unilaterally impose tariffs on imports. No president before Trump had ever used IEEPA for that purpose.\n\n\"The president asserts the extraordinary power to unilaterally impose tariffs of unlimited amount, duration and scope,\" Roberts wrote. But the administration \"points to no statute\" in which Congress has previously said IEEPA's language could apply to tariffs. \"We hold that IEEPA does not authorize the president to impose tariffs.\"\n\nThe ruling invalidates two major categories of Trump tariffs: the country-by-country \"reciprocal\" tariffs ranging from 34% for China to a 10% baseline for most nations, and the 25% tariffs imposed on goods from Canada, Mexico, and China in response to fentanyl. It does not affect steel and aluminum tariffs imposed under different legal authority.\n\nRoberts invoked the \"major questions doctrine\" — the same principle the court used to block Biden's student loan forgiveness — holding that Congress must explicitly authorize policies with sweeping national impact. The symmetry is striking: a conservative legal theory now cuts against a conservative president.\n\nStocks rallied immediately on the news. Trump, informed of the ruling during a meeting with governors, called it a \"disgrace\" and said he has a backup plan. As recently as Thursday he had warned: \"Without tariffs, this country would be in such trouble right now.\"\n\nBut any backup plan faces hurdles. Alternative legal pathways for reimposing tariffs would likely require congressional approval or Commerce Department investigations — slower processes that give opponents time to organize.\n\nThe immediate question is refunds. Companies have paid billions in tariffs since the regime began, and hundreds have already sued for their money back. The court did not directly address refunds, but business groups including We Pay the Tariffs — representing over 800 companies — immediately demanded \"full, fast and automatic\" reimbursement.\n\n\"These new tariffs were arbitrary, unpredictable, and bad business,\" said Victor Schwartz, a New York wine and spirits importer. \"Thankfully, courts at every level recognized these duties for what they were: unconstitutional government overreach.\"\n\nThe ruling marks a rare moment where the Supreme Court — reshaped by Trump's own appointments — has decisively checked his power. It signals that even a sympathetic judiciary has limits when it comes to presidential authority over the economy."
}
