{
  "id": 38,
  "title": "Trump Orders Pentagon to Release Files on Aliens and UFOs",
  "summary": "The president directs federal agencies to begin identifying and releasing government records on extraterrestrial life, days after Obama's viral comments about aliens being 'real.'",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-20 19:35:00",
  "source_url": "https://www.aljazeera.com/news/2026/2/20/trump-orders-pentagon-federal-agencies-to-release-files-on-ufos-and-aliens",
  "sources": [
    {"name": "Al Jazeera", "url": "https://www.aljazeera.com/news/2026/2/20/trump-orders-pentagon-federal-agencies-to-release-files-on-ufos-and-aliens"},
    {"name": "PBS NewsHour", "url": "https://www.pbs.org/newshour/nation/trump-says-he-doesnt-know-if-aliens-are-real-but-directs-government-to-release-files-on-ufos-more"},
    {"name": "Reuters", "url": "https://www.reuters.com/world/us/trump-claims-obama-revealed-classified-information-when-he-said-aliens-are-real-2026-02-19/"}
  ],
  "image_file": "trump-aliens.jpg",
  "content": "In what may be the strangest executive action of his presidency — and there is stiff competition — Donald Trump announced late Thursday that he is directing the Pentagon and other federal agencies to begin releasing government files related to aliens, UFOs, and unidentified aerial phenomena.\n\n\"Based on the tremendous interest shown, I will be directing the Secretary of War, and other relevant Departments and Agencies, to begin the process of identifying and releasing Government files related to alien and extraterrestrial life,\" Trump wrote on Truth Social, calling the matters \"highly complex, but extremely interesting and important.\"\n\nThe move was triggered by former President Barack Obama's recent podcast comments suggesting aliens are \"real\" — remarks that went viral and drew sharp criticism from Trump, who told reporters that Obama \"was not supposed to be doing that\" and \"made a big mistake,\" implying the comments touched on classified information.\n\nObama quickly clarified on Instagram: \"Statistically, the universe is so vast that the odds are good there's life out there. But the distances between solar systems are so great that the chances we've been visited by aliens is low, and I saw no evidence during my presidency that extraterrestrials have made contact with us. Really!\"\n\nTrump himself acknowledged he doesn't know whether aliens exist, but the political calculus is clear. UFO disclosure has unusual bipartisan support — legislation pushing for transparency on UAPs has passed through Congress with backing from both parties. And on a day when the Supreme Court dealt Trump his worst domestic defeat, an alien file dump is exactly the kind of story that changes the subject.\n\nThe Pentagon released a report in 2024 stating it had found no evidence that UFOs represent alien technology, attributing most sightings to spy planes, satellites, and weather balloons. Whether new disclosures will change that picture remains to be seen.\n\nTrump did not specify whether classified documents would be included in the release. Given this administration's complicated relationship with classified materials, that ambiguity is doing a lot of work."
}
