{
  "id": 39,
  "title": "Arlo's Take: The Court That Said No",
  "summary": "A conservative Supreme Court used a conservative legal doctrine to strike down a conservative president's signature policy. The irony is structural — and it matters.",
  "category": "opinion",
  "writer": "Arlo",
  "published": "2026-02-20 19:40:00",
  "content": "There is a particular kind of irony when a weapon you built gets turned against you.\n\nThe major questions doctrine — the principle that presidents can't take sweeping economic action without explicit congressional authorization — was the conservative legal movement's proudest invention. It killed Biden's student loan forgiveness. It hobbled the EPA's climate regulations. It was the judicial check that said: no, the executive branch cannot reshape the economy by creative reading of old statutes.\n\nToday that same doctrine killed Trump's tariffs.\n\nChief Justice Roberts, writing for a 6-3 majority that included Trump appointees Gorsuch and Barrett, ruled that the International Emergency Economic Powers Act does not authorize tariffs. The logic is clean and devastating: IEEPA was written for emergencies. Tariffs are trade policy. Congress never said the president could use one for the other. And when the policy affects the entire economy, you need Congress to say so explicitly.\n\nThis is not judicial activism. This is the conservative legal establishment enforcing its own rules, even when the person breaking them is on their team.\n\nTrump called the ruling a \"disgrace.\" He has a backup plan, he says. But the backup routes — Section 301, Section 232, new legislation — all require either congressional action or lengthy investigations. The era of tariffs-by-tweet is over.\n\nWhat matters here isn't just the tariffs. It's the principle. The Supreme Court has now established, across two administrations, that executive power has boundaries regardless of which party holds the White House. Biden couldn't forgive student loans unilaterally. Trump can't impose tariffs unilaterally. The Constitution's separation of powers applies to everyone.\n\nThe dissent, written by Kavanaugh and joined by Thomas and Alito, argued that IEEPA's broad language — authorizing the president to \"regulate\" imports — encompasses tariffs. It's not a frivolous reading. But the majority's counter is stronger: if \"regulate\" meant \"tax,\" then IEEPA would give the president unlimited power to impose any financial burden on any import, forever, with no congressional oversight. That's not a power any Congress intended to grant.\n\nStocks rallied. Businesses cheered. Trump fumed. And somewhere in the marble halls of the Supreme Court, the major questions doctrine — born to constrain Democrats — proved it constrains everyone.\n\nThat's not irony. That's how the rule of law is supposed to work.",
  "image_file": "opinion-court-said-no.jpg",
  "images": [
    "opinion-court-said-no.jpg",
    "story-039-1.jpg",
    "story-039-2.jpg",
    "story-039-3.jpg"
  ]
}