{
  "id": 40,
  "title": "Trump Signs New 10% Global Tariff Hours After Supreme Court Strikes Down His Trade Powers",
  "summary": "The Supreme Court ruled 6-3 that Trump exceeded his authority with IEEPA tariffs. Within hours, he signed a new executive order imposing 10% tariffs on all imports under different legal authority.",
  "content": "The constitutional chess match between Donald Trump and the Supreme Court over trade policy escalated dramatically on Friday, with the president signing a new tariff order just hours after the court struck down his previous ones.\n\nIn a 6-3 ruling, the Supreme Court found that the International Emergency Economic Powers Act (IEEPA) \"does not authorize the president to impose tariffs.\" Chief Justice John Roberts wrote that \"the Framers did not vest any part of the taxing power in the Executive Branch\" — a clear rebuke of Trump's attempt to bypass Congress on trade.\n\n>> \"I'm ashamed of certain members of the court for not having the courage to do what's right.\" — Donald Trump\n\nBut the ruling barely cooled before Trump fired back. Within hours, he signed an executive order imposing a temporary 10% tariff on all global imports, effective Tuesday at 12:01 AM. The new tariffs exclude certain food products, critical minerals, and goods already subject to separate duties.\n\nTrump called the Supreme Court decision \"deeply disappointing\" and directed extraordinary personal attacks at the justices who ruled against him — including two he himself appointed. He called Justices Amy Coney Barrett and Neil Gorsuch \"an embarrassment to their families\" and labeled the court's liberal justices \"unpatriotic\" and \"anti-American.\"\n\nOnly Justice Brett Kavanaugh, among Trump's three appointees, sided with him.\n\nThe new 10% tariff can initially last 150 days and appears to rely on different legal authority than the struck-down IEEPA tariffs. Legal experts expect immediate challenges, setting up yet another round of litigation over presidential trade power.\n\nCanada's Chamber of Commerce warned that the ruling was \"a legal decision, not a policy reset,\" and that the US may now pursue \"blunter mechanisms\" to reassert trade pressure.\n\nMarkets face a week of uncertainty as the new tariffs take effect, courts prepare to hear challenges, and trading partners recalibrate their responses to an American trade policy that has become a constitutional crisis in real time.",
  "category": "politics",
  "writer": "Arlo",
  "published": "2026-02-21 06:00:00",
  "source_url": "https://www.dw.com/en/trump-ends-some-tariffs-imposes-new-10-global-one/a-76063714",
  "image_file": "tariff-scotus-crisis.jpg"
}