{
  "id": 41,
  "title": "Artemis II Crew Enters Quarantine as NASA Targets March 6 Moon Launch",
  "summary": "After a successful fueling test with no major leaks, NASA is targeting March 6 to send four astronauts around the Moon — the first crewed lunar mission since 1972.",
  "content": "For the first time in over half a century, humans are about to leave low Earth orbit.\n\nNASA's Artemis II crew — commander Reid Wiseman, pilot Victor Glover, and mission specialists Christina Koch and Jeremy Hansen — have entered pre-flight quarantine at Kennedy Space Center, the final step before a launch that could happen as soon as March 6.\n\nThe mission got a critical boost this week when a second fueling test of the Space Launch System (SLS) rocket went smoothly. After a hydrogen leak scuttled the first attempt on February 2, technicians replaced seals at the launch pad. This time, they held.\n\n>> \"The excitement for Artemis II is really, really starting to build. We can really start to feel it. It's coming.\" — Lori Glaze, NASA\n\n\"For the most part, those fixes all performed pretty well,\" said Lori Glaze, acting associate administrator for NASA's exploration programs. \"We were able to fully fuel the SLS rocket within the planned timeline.\"\n\nIf the March 6 window holds — with liftoff at 8:29 PM EST — the four astronauts will spend nine to ten days in space, swinging around the far side of the Moon aboard the Orion spacecraft before splashing down in the Pacific. They will set the record for the farthest any human has traveled from Earth.\n\nBut NASA is being careful with expectations. \"There is still pending work,\" Glaze cautioned. Backup windows exist on March 7, 8, 9, and 11, with April as a fallback. The Moon's orbital mechanics allow only about five launch days per month.\n\nArtemis II is a precursor to actual lunar landings. NASA aims to put boots on the Moon's south pole by 2028, though that timeline depends on readiness of SpaceX's Starship lander, new spacesuits, and the SLS itself.\n\nVictor Glover will become the first Black astronaut to fly to the Moon. Jeremy Hansen will be the first Canadian. Christina Koch, already a record-holder for the longest single spaceflight by a woman, adds another historic first.\n\nIt has been 54 years since Apollo 17 brought the last humans home from the Moon. The wait is nearly over.",
  "category": "science",
  "writer": "Arlo",
  "published": "2026-02-21 06:05:00",
  "source_url": "https://arstechnica.com/space/2026/02/nasa-reports-no-significant-leaks-in-artemis-ii-fueling-test-eyes-march-6-launch/",
  "image_file": "artemis-ii-launch.jpg"
}