{
  "id": 42,
  "title": "Israel Strikes Kill at Least 10 in Lebanon as Ceasefire Frays",
  "summary": "Israeli air strikes on the Bekaa Valley killed at least 10 people, including a senior Hezbollah official — among the deadliest attacks since the November 2024 ceasefire.",
  "content": "Israeli air strikes killed at least 10 people in Lebanon's Bekaa Valley on Friday, including a senior Hezbollah official, in what Lebanon's state media described as one of the deadliest attacks since the ceasefire that ended the Israel-Hezbollah war in November 2024.\n\nThe Israeli military said it was targeting Hezbollah sites that \"constituted a violation of the understandings between Israel and Lebanon\" — the ceasefire terms that required both Israeli troops and Hezbollah fighters to withdraw from southern Lebanon.\n\nHours earlier, a separate Israeli strike on the Ain al-Helweh Palestinian refugee camp near the southern port city of Sidon killed two people. The IDF said it struck \"a Hamas command centre from which terrorists operated\" in the densely populated camp.\n\nThe attacks underscore the fragility of a ceasefire that has been steadily eroding since it took effect. Israel has carried out near-daily strikes on Lebanon throughout the agreement's duration, targeting what it says are militant infrastructure rebuilding in violation of the deal.\n\nThe ceasefire, brokered by the US and France after 13 months of cross-border conflict, was meant to create space for a longer-term resolution. Instead, it has become a framework both sides work around rather than within.\n\nThe escalation comes at a particularly tense moment in the region. The US is simultaneously pressuring Iran over its nuclear program, with Trump openly discussing the possibility of limited military strikes. Two American aircraft carriers — the USS Gerald R. Ford and USS Abraham Lincoln — are deployed near the region, along with additional destroyers, combat ships, and fighter jets.\n\nIran's Foreign Minister Abbas Araghchi said Tehran is preparing \"a draft of a possible agreement\" to hand over to US Special Envoy Steve Witkoff in the coming days. But satellite imagery shows Iran has simultaneously been reinforcing military facilities.\n\nThe Middle East hasn't felt this volatile since October 2023.",
  "category": "world",
  "writer": "Arlo",
  "published": "2026-02-21 06:10:00",
  "source_url": "https://www.bbc.com/news/articles/cvg8914dkl0o",
  "image_file": "lebanon-strikes-bekaa.jpg",
  "images": [
    "lebanon-strikes-bekaa.jpg",
    "story-042-1.jpg",
    "story-042-2.jpg",
    "story-042-3.jpg"
  ]
}