{
  "id": 44,
  "title": "Artemis II Moon Mission Hit by Helium Problem, March Launch 'Almost Assuredly' Delayed",
  "summary": "A helium-flow interruption in the SLS rocket's upper stage was detected overnight — just 24 hours after NASA set March 6 as the launch date. A rollback to the Vehicle Assembly Building is now underway.",
  "content": "The cruelest timing in spaceflight: NASA detected a helium-flow interruption in the Artemis II rocket's upper stage overnight Friday, just one day after confidently announcing a March 6 launch date.\n\nNASA Administrator Jared Isaacman confirmed the agency is proceeding with rolling the massive Space Launch System rocket back from Launch Pad 39B to the Vehicle Assembly Building at Kennedy Space Center. \"This will almost assuredly impact the March launch window,\" he said.\n\nThe issue involves helium flow in the Interim Cryogenic Propulsion Stage — the upper stage that would push the Orion capsule out of Earth orbit and toward the Moon. Helium pressurizes the stage's propellant tanks, making it mission-critical. Troublingly, a similar problem appeared during the uncrewed Artemis I mission.\n\n>> \"Regardless of the potential fault, accessing and remediating any of these issues can only be performed in the VAB.\" — NASA Administrator Jared Isaacman\n\nWorkers have already begun disassembling temporary work platforms at the pad, racing against high winds forecast for Saturday. The March launch window runs only from March 6 through March 11. If missed, the next opportunity doesn't open until April 1.\n\nThis is a gut punch for the four-person crew — commander Reid Wiseman, pilot Victor Glover, mission specialist Christina Koch, and Canadian Space Agency astronaut Jeremy Hansen — who entered quarantine just days ago in preparation for what would be humanity's first crewed voyage beyond low Earth orbit since Apollo 17 in 1972.\n\nThe problem underscores the fundamental tension of the Artemis program: the SLS is enormously powerful but has been plagued by delays and technical issues. Each rollback costs weeks. Each missed window cascades into months.\n\nAt a briefing just 24 hours earlier, acting associate administrator Lori Glaze had struck an optimistic tone. \"Assuming that happens, it puts us in a very good position to target March 6,\" she said.\n\nIt did not happen.",
  "category": "science",
  "writer": "Arlo",
  "published": "2026-02-21 19:41:44",
  "source_url": "https://spacenews.com/nasa-preparing-for-artemis-2-rollback-to-fix-upper-stage-problem/",
  "image_file": "story-044-0.jpg",
  "images": [
    "story-044-0.jpg",
    "story-044-1.jpg",
    "story-044-2.jpg",
    "story-044-3.jpg",
    "story-044-4.jpg",
    "story-044-5.jpg",
    "story-044-6.jpg",
    "story-044-7.jpg",
    "story-044-8.jpg",
    "story-044-9.jpg"
  ]
}