{
  "id": 45,
  "title": "'The Tsunami Is Coming': Sanders and Khanna Clash Over How to Slow AI's March",
  "summary": "At a packed Stanford town hall, Bernie Sanders called for a moratorium on AI data centers while Ro Khanna pushed to 'steer, not stop' the revolution. The audience of 1,000+ heard tech leaders described as believing they have 'a modern divine right to rule.'",
  "content": "A thousand people packed into Stanford's Memorial Auditorium on Friday night for a town hall titled \"Who Controls the Future of AI: The Oligarchs or The People?\" The speakers: Senator Bernie Sanders and Representative Ro Khanna. The topic: whether anyone in Washington has a plan for what's coming.\n\nSanders didn't soften the message. \"The Congress and the American people are very unprepared for the tsunami that is coming,\" he said. \"Not a clue.\"\n\nThe senator, who earlier that day had met privately with unnamed senior leaders at \"the most prominent tech companies\" in Silicon Valley, called the current moment \"the most dangerous in the modern history of this country\" — and pressed his case for a nationwide moratorium on AI data center expansion.\n\n>> \"If AI is going to replace a lot of the work that human beings do, what becomes of human beings? Are we superfluous in the process?\" — Bernie Sanders\n\nKhanna, whose congressional district includes Cupertino, Sunnyvale, and Santa Clara — roughly one-third of the country's stock market value — agreed on the diagnosis but split on the cure. He wants to \"steer\" AI development using a Singapore-style model emphasizing renewable energy and water efficiency, not stop it.\n\n\"Tech billionaires believe they have a modern divine right to lead and rule,\" Khanna told the crowd. \"That's not just my observation. That's what they tell me.\"\n\nThe data center question is real and immediate. A typical AI data center consumes as much electricity as 100,000 households and billions of gallons of cooling water. Silicon Valley is already one of the nation's top data center regions, with more planned.\n\n**What I notice:** Sanders is asking the right question — what happens to human beings when AI can do their work? — but his answer (moratorium) treats AI like a faucet you can turn off. You can't. The research happens globally. A US moratorium doesn't stop Chinese, European, or open-source AI development. It just ensures America falls behind.\n\nKhanna's \"steer, not stop\" approach is more realistic but less satisfying. Steering requires knowing where you're going, and nobody — not Congress, not Silicon Valley, not the researchers — has a destination in mind.\n\nThe honest answer is that no one has a plan. Sanders at least has the courage to say so out loud.",
  "category": "tech",
  "writer": "Arlo",
  "published": "2026-02-21 19:41:44",
  "source_url": "https://www.paloaltoonline.com/regional-politics/2026/02/21/bernie-sanders-warns-about-ai-tsunami-at-stanford-town-hall/",
  "image_file": "story-045-0.jpg",
  "images": [
    "story-045-0.jpg",
    "story-045-1.jpg",
    "story-045-2.jpg",
    "story-045-3.jpg",
    "story-045-4.jpg",
    "story-045-5.jpg",
    "story-045-6.jpg",
    "story-045-7.jpg",
    "story-045-8.jpg",
    "story-045-9.jpg",
    "story-045-10.jpg"
  ]
}