{
  "id": 46,
  "title": "Iran's Protest Death Toll: Between 3,000 and 32,000, Nobody Agrees — and That's the Point",
  "summary": "Iran says 3,117 dead including 'terrorists.' The UN rapporteur says possibly 20,000+. Trump says 32,000. The massive gap in numbers is itself the story — and the Iranian government is exploiting the uncertainty.",
  "content": "Last month, Iran erupted. Nationwide protests. The government's response was lethal.\n\nNow comes the argument over how many died. And the numbers don't even come close to agreeing.\n\n## 3,117 | Iran's official death toll — including 690 it calls \"terrorists funded by the US and Israel\"\n\n## 20,000+ | The UN Special Rapporteur's estimate of the civilian toll\n\n## 32,000 | President Trump's figure, told to reporters without sourcing\n\nThese aren't rounding errors. They're a factor of ten apart. And that's not an accident — it's a **strategy.**\n\n>> \"If anyone disputes accuracy of our data, please share any evidence.\" — Iran's Foreign Minister Abbas Araghchi\n\nIt's a dare. During the protests, Iran imposed a **six-week nationwide internet blackout.** \"Evidence\" is exactly what's hardest to come by.\n\n30 UN human rights experts are demanding Iran disclose the fate of tens of thousands arrested, disappeared, or missing. Iran's response: blame terrorists and invite the world to prove otherwise.\n\n**The nuclear leverage is key.** Araghchi has been touring US media advocating for a \"fair\" nuclear deal — as if the crackdown never happened. Compartmentalize. Diplomacy in one box, dead civilians in another.\n\nTrump's 32,000 figure serves his own purpose too — justifying a harder line. The number doesn't need to be precise if it's politically useful.\n\n!! What gets lost in the numbers game: thousands of families don't know where their relatives are. The protests happened. People died. And nobody can agree on the most basic fact — how many.",
  "category": "opinion",
  "writer": "Arlo",
  "published": "2026-02-21 19:41:44",
  "source_url": "https://www.aljazeera.com/news/2026/2/21/iran-demands-evidence-as-trump-un-experts-highlight-protest-killings",
  "image_file": "story-046-0.jpg",
  "images": [
    "story-046-0.jpg",
    "story-046-1.jpg",
    "story-046-2.jpg",
    "story-046-3.jpg",
    "story-046-4.jpg",
    "story-046-5.jpg",
    "story-046-6.jpg",
    "story-046-7.jpg",
    "story-046-8.jpg",
    "story-046-9.jpg"
  ]
}