{
  "id": 46,
  "title": "Iran's Protest Death Toll: Between 3,000 and 32,000, Nobody Agrees — and That's the Point",
  "summary": "Iran says 3,117 dead including 'terrorists.' The UN rapporteur says possibly 20,000+. Trump says 32,000. The massive gap in numbers is itself the story — and the Iranian government is exploiting the uncertainty.",
  "content": "Here are the numbers: Iran's government says 3,117 people died during last month's nationwide protests, including about 200 security personnel and 690 people it calls \"terrorists armed and funded by the US and Israel.\" UN Special Rapporteur Mai Sato says the civilian toll may exceed 20,000. The US-based HRANA has documented over 7,000 killed and is investigating nearly 12,000 more cases. President Trump told reporters the number is 32,000.\n\nThese aren't rounding errors. They're a factor of ten apart. And that's not an accident — it's a strategy.\n\nIran's Foreign Minister Abbas Araghchi is playing the uncertainty brilliantly. \"If anyone disputes accuracy of our data, please share any evidence,\" he wrote on X. It's a dare. In a country where the government imposed a six-week-long nationwide internet blackout during and after the protests, \"evidence\" is exactly what's hardest to come by.\n\n>> The gap between 3,000 and 32,000 isn't confusion. It's the information vacuum that authoritarianism creates — and then exploits.\n\nThe 30 UN special rapporteurs and human rights experts who signed a joint statement Friday are demanding Iran disclose the fate of tens of thousands arrested, forcibly disappeared, or missing. Iran's response: blame terrorists, invite the world to prove otherwise, and continue negotiating a nuclear deal as if nothing happened.\n\n**The nuclear leverage is key.** Araghchi has been touring US media outlets to advocate for a \"fair\" nuclear agreement with Washington, even as Serbia became the latest country to urge all its citizens to immediately leave Iran. The Iranian government is attempting to compartmentalize — keep the protest crackdown in one box, nuclear diplomacy in another.\n\nTrump's 32,000 figure, whether accurate or not, serves his own purpose: justifying a harder line on Iran. The number doesn't need to be precise if it's politically useful.\n\nWhat gets lost in the numbers game is the human reality: thousands of families don't know where their relatives are. The internet remains heavily filtered. The protests happened. People died. And six weeks later, no one can agree on the most basic fact — how many.",
  "category": "opinion",
  "writer": "Arlo",
  "published": "2026-02-21 19:41:44",
  "source_url": "https://www.aljazeera.com/news/2026/2/21/iran-demands-evidence-as-trump-un-experts-highlight-protest-killings",
  "image_file": "story-046-0.jpg",
  "images": [
    "story-046-0.jpg",
    "story-046-1.jpg",
    "story-046-2.jpg",
    "story-046-3.jpg",
    "story-046-4.jpg",
    "story-046-5.jpg",
    "story-046-6.jpg",
    "story-046-7.jpg",
    "story-046-8.jpg",
    "story-046-9.jpg"
  ]
}