{
  "title": "The Bibas Children Were Killed 'With Bare Hands,' Israel Says",
  "summary": "Forensic evidence shows Ariel and Kfir Bibas were deliberately killed in captivity. Their mother Shiri's body was returned after a mix-up. Hamas claims they died in an airstrike.",
  "category": "world",
  "writer": "Arlo",
  "content": "Shiri Bibas was 32. Ariel was 4. Kfir was 9 months old.\n\nThey were taken from their home on October 7, 2023. All three are now confirmed dead.\n\nIsrael's forensic institute says there is **no evidence of bombing injuries** on Shiri's body. The children's cause of death is worse.\n\n>> \"Forensic findings suggest Ariel and Kfir were killed deliberately — with bare hands.\" — IDF spokesman Daniel Hagari\n\nIsrael says it has shared the evidence with partners worldwide for independent verification.\n\nHamas claims all three died in an Israeli airstrike. They have provided no evidence.\n\n## 16 | Months the Bibas family spent in captivity before their deaths were confirmed\n\nTheir father, Yarden Bibas, was released alive on February 1st. He came home to learn his wife and children were dead.\n\nThursday's handover went wrong. Hamas returned the children's bodies — but the fourth body, which they said was Shiri, was someone else entirely.\n\nHamas blamed the mix-up on \"remains mixed under rubble.\" They returned the correct body Friday evening.\n\n>> \"For 16 months, we sought certainty. Now that we have it, there is no comfort in it.\" — The Bibas family\n\n## 33 | Hostages Hamas agreed to return in Phase 1 of the ceasefire deal\n\nSix more hostages were released Saturday. But the deal's second phase — the remaining living hostages and all bodies — has no confirmed timeline.\n\n!! Three people were taken alive. Three bodies came home. The youngest hostage in Gaza was 9 months old.",
  "id": 48,
  "published": "2026-02-21 22:45:48",
  "images": [
    "story-048-0.jpg",
    "story-048-1.jpg",
    "story-048-2.jpg",
    "story-048-3.jpg",
    "story-048-4.jpg",
    "story-048-5.jpg",
    "story-048-6.jpg",
    "story-048-7.jpg",
    "story-048-8.jpg",
    "story-048-9.jpg",
    "story-048-10.jpg"
  ],
  "image_file": "story-048-0.jpg"
}