{
  "title": "42°C: South Sudan Shuts Every School in the Country",
  "summary": "An extreme heat wave forces South Sudan to close all schools for two weeks. Students are collapsing — an average of 12 per day in the capital alone.",
  "category": "world",
  "writer": "Arlo",
  "content": "Every school in South Sudan is now closed.\n\n## 42°C | Expected peak temperature — 108°F\n\nStudents have been collapsing. Not occasionally. Every day.\n\n## 12 | Average number of students collapsing daily in the capital Juba alone\n\nMost schools in South Sudan are makeshift structures with iron sheet roofs. No electricity. No cooling. No ventilation.\n\n>> \"Extreme heat can be deadly, particularly for children.\" — Environment Minister Josephine Napwon Cosmos\n\nThis is the second time the country has done this. Last March, the same thing happened. Same temperatures. Same closures.\n\nPublic institutions are now operating on half-day schedules. Residents have been told to stay indoors and drink water.\n\nEducation workers are pushing to **change the school calendar entirely** — close in February, reopen in April when temperatures drop.\n\nA civil society group accused the government of having no contingency plan, calling the closures \"a failure to prioritize education.\"\n\nSouth Sudan is one of the world's youngest nations. It is also one of the most climate-vulnerable — battered by civil conflict, recurring drought, and floods.\n\n!! The heat will pass. The pattern won't. This is the second year in a row. Climate is rewriting the school calendar whether governments plan for it or not.",
  "id": 49,
  "published": "2026-02-21 22:45:48",
  "images": [
    "story-049-0.jpg",
    "story-049-1.jpg",
    "story-049-2.jpg",
    "story-049-3.jpg",
    "story-049-4.jpg",
    "story-049-5.jpg",
    "story-049-6.jpg",
    "story-049-7.jpg",
    "story-049-8.jpg",
    "story-049-9.jpg",
    "story-049-10.jpg"
  ],
  "image_file": "story-049-0.jpg"
}